# x = [['Офис'], ['Тестирование'], ['ВРУ-3.1', 'Офис'], ['ВРУ-3.2', 'Офис'], ['ВРУ 1-го этажа', 'Офис'],
#      ['ВРУ 2-го этажа', 'Офис'], ['Ввод-1 (контр.)', 'ВРУ-3.1'], ['SATEC PM180 Test', 'Тестирование'],
#      ['Ввод-2 (контр.)', 'ВРУ-3.2'], ['Ввод-2 (ком.)', 'ВРУ 2-го этажа'], ['Ввод-1 (ком.)', 'ВРУ 1-го этажа']]
# z = 0
# for i in x:
#     if len(i) == 1:
#         z += 1
#     print(z)


i = [{'title': 'Офис', 'key': 'Офис', 'children': [{'title': 'ВРУ-3.1', 'key': 'ВРУ-3.1'}, {'title': 'ВРУ-3.2', 'key': '0-1'}, {'title': 'ВРУ 1-го этажа', 'key': '0-2'}, {'title': 'ВРУ 2-го этажа', 'key': '0-3'}]},
     {'title': 'ВРУ-3.1', 'key': 'ВРУ-3.1', 'children': [{'title': 'Ввод-1 (контр.)', 'key': 'Ввод-1 (контр.)'}]},
     {'title': 'Тестирование', 'key': 'Тестирование', 'children': [{'title': 'SATEC PM180 Test', 'key': 'SATEC PM180 Test'}]},
     {'title': 'ВРУ-3.2', 'key': 'ВРУ-3.2', 'children': [{'title': 'Ввод-2 (контр.)', 'key': 'Ввод-2 (контр.)'}]},
     {'title': 'ВРУ 2-го этажа', 'key': 'ВРУ 2-го этажа', 'children': [{'title': 'Ввод-2 (ком.)', 'key': 'Ввод-2 (ком.)'}]},
     {'title': 'ВРУ 1-го этажа', 'key': 'ВРУ 1-го этажа', 'children': [{'title': 'Ввод-1 (ком.)', 'key': 'Ввод-1 (ком.)'}]}]

r = [{'children': [{'key': 'Ввод-1 (контр.)', 'title': 'Ввод-1 (контр.)'}], 'key': 'ВРУ-3.1', 'title': 'ВРУ-3.1'},
     {'key': '0-1', 'title': 'ВРУ-3.2'}, {'key': '0-2', 'title': 'ВРУ 1-го этажа'}, {'key': '0-3', 'title': 'ВРУ 2-го этажа'}]

for z in r:
    print(z)